ijiki16/KUONGSHUN-AD176-ESP32-WiFi-Camera-Mecanum-4WD-Smart-Robot-Car/3_Code_and_Tutorial/5.2_ESP32Cam_WIFI_Web/app_httpd.cpp
        canvas {
        margin: auto;
        display: block;

        }
        .tITULO{
            text-align: center;
            color: rgb(97, 97, 97);
            
        }
        .LINK{
            color: red;
            width: 60px;
            margin: auto;
            display: block;
            font-size: 14px;
        }
        .cont_stream{
            width: 90%;
            max-width: 700px;

            border: 1px solid red;
            margin: auto;
            display:block;
        }
        .cont_flex{
            margin: 20px auto 20px;
            width: 90%;
            max-width: 400px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
        }
        .cont_flex_threebuttom{
            margin: 20px auto 20px;
            width: 70%;
            max-width: 400px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
        }
        .cont_flex_stream{
            margin: 20px auto 20px;
            width: 70%;
            max-width: 400px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
        }
        .cont_flex_model{
            margin: 20px auto 20px;
            width: 78%;
            max-width: 400px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
        }
        .cont_flex_twobuttom{
            margin: 20px auto 20px;
            width: 93%;
            max-width: 400px;
            display: flex;
            flex-wrap: wrap;
            justify-content: space-around;
        }
        .cont_flex button{
            width: 70px;
            height: 30px;
            border: none;
            background-color: red;
            border-radius: 10px;
            color: white;
        }
        .cont_flex_stream button{
            width: 70px;
            height: 30px;
            border: none;
            background-color: green;
            border-radius: 10px;
            color: white;
        }
        .cont_flex_model button{
            width: 100px;
            height: 30px;
            border: none;
            background-color: yellow;
            border-radius: 10px;
            color: black;
        }
        .cont_flex_threebuttom button{
            width: 70px;
            height: 30px;
            border: none;
            background-color: red;
            border-radius: 10px;
            color: white;
        }
        .cont_flex_twobuttom button{
            width: 70px;
            height: 30px;
            border: none;
            background-color: red;
            border-radius: 10px;
            color: white;
        }
        .cont_flex button:active{
            background-color: blue;
        }
        .cont_flex_twobuttom button:active{
            background-color: blue;
        }
        .cont_flex_threebuttom button:active{
            background-color: blue;
        }
        .cont_flex_model button:active{
            background-color: blue;
        }

        input{-webkit-user-select:auto;} 
        input[type=range]{-webkit-appearance:none;width:300px;height:25px;background:#cecece;cursor:pointer;margin:0}
        input[type=range]:focus{outline:0}
        input[type=range]::-webkit-slider-runnable-track{width:100%;height:2px;cursor:pointer;background:#EFEFEF;border-radius:0;border:0 solid #EFEFEF}
        input[type=range]::-webkit-slider-thumb{border:1px solid rgba(0,0,30,0);height:22px;width:22px;border-radius:50px;background:#ff3034;cursor:pointer;-webkit-appearance:none;margin-top:-10px}

        </style>
    </head>
    <body>
         
        <!--  <canvas id="canvas" width="200" height="90"></canvas>  -->
        <h1 class="tITULO">KUONGSHUN ESP32CAM ROBOT</h1>
        <!--  <a href="https://www.youtube.com" class="LINK">YOUTUBE</a>  -->
    
        <img id="stream" src="" class="cont_stream">      

        <div class="cont_flex_stream">     
            <button type="button" id="toggle-stream">Start Screen</button> 
            <button type="button" id="get-still">Pause Screen</button> 
            <button type="button" id="close-stream">Close Screen</button>
        </div>

        <!--
        <div class="cont_flex"><div><input type="checkbox" style="margin-right: 5px;" id="nostop" onclick="var noStop=0;if (this.checked) noStop=1;fetch(document.location.origin+'/control?var=nostop&val='+noStop);">No Stop</div></div>
        -->
        
        <div class="cont_flex_threebuttom">     
            <button type="button" id="leftup" ontouchstart="fetch(document.location.origin+'/control?var=car&val=6');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Leftup</button>
            <button type="button" id="forward" ontouchstart="fetch(document.location.origin+'/control?var=car&val=1');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Forward</button>
            <button type="button" id="rightup" ontouchstart="fetch(document.location.origin+'/control?var=car&val=7');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Rightup</button>
        </div>

        <div class="cont_flex_twobuttom">     
            <button type="button" id="turnleft" ontouchstart="fetch(document.location.origin+'/control?var=car&val=4');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">TurnLeft</button>
            <!--    <button type="button" id="Stop" ontouchstart="fetch(document.location.origin+'/control?var=car&val=3');">Stop</button>    -->
            <button type="button" id="turnright" ontouchstart="fetch(document.location.origin+'/control?var=car&val=2');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">TurnRight</button>  
        </div>

        <div class="cont_flex_threebuttom">     
            <button type="button" id="leftdown" ontouchstart="fetch(document.location.origin+'/control?var=car&val=8');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Leftdown</button>
            <button type="button" id="backward" ontouchstart="fetch(document.location.origin+'/control?var=car&val=5');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Backward</button>
            <button type="button" id="rightdown" ontouchstart="fetch(document.location.origin+'/control?var=car&val=9');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Rightdown</button>
        </div>

        <div class="cont_flex_twobuttom">     
            <button type="button" id="clockwise" ontouchstart="fetch(document.location.origin+'/control?var=car&val=10');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Clockwise</button>
            <button type="button" id="Contrarotate" ontouchstart="fetch(document.location.origin+'/control?var=car&val=15');"ontouchend="fetch(document.location.origin+'/control?var=car&val=3');">Contrarotate</button>  
        </div>

        <div class="cont_flex_model">     
            <button type="button" id="model1" onmousedown="fetch(document.location.origin+'/control?var=car&val=11');">Free Control</button>
            <button type="button" id="model2" onmousedown="fetch(document.location.origin+'/control?var=model&val=2');">Obstacle Avoidance</button>
        </div>

        <div class="cont_flex_model">     
            <button type="button" id="model3" onmousedown="fetch(document.location.origin+'/control?var=model&val=3');">Object Following</button>
            <button type="button" id="model4" onmousedown="fetch(document.location.origin+'/control?var=model&val=4');">Line Tracing</button>
        </div>

        
